# Вывести на экран фигуры со звездочек
# (Ромб, Елочка, Треугольник, Квадрат, ступеньки)


a = int(input('longest = '))
b = int(input('higest = '))

for i in range(a):
    print('*' * i)

