# Вывести на экран фигуры со звездочек
# (Ромб, Елочка, Треугольник, Квадрат, ступеньки)


a = input('longest = ')
b = input('higest = ')

print(a)