# Напишите программу, запрашивающую имя, фамилия, отчество и номер группы
# студента и выводящую введённые данные в следующем виде
# ************************************
# *Лабораторная работа № 1   *
# *Выполнил(а): ст. гр. ЗИ-123 *
# *Иванов Андрей Петрович    *
# ************************************
# Необходимо, чтобы программа сама определяла нужную длину рамки.
# Сама же длина рамки зависит от длины наибольшей строки внутри рамки.
# Используя циклы for легко можно выровнять стороны рамки.


q = 0
a = 'Лабораторная работа № 1'
b = 'Выполнил(а):' + input('group= ')
c = input('name= ')

d = len(a)
e = len(b)
f = len(c)

q = max(d,e,f)

print('*' * (q+4))
print('* ' + a + ' ' * (q - d) + '*')
print('* ' + b + ' ' * (q - e) + ' *')
print('* ' + c + ' ' * (q - f) + ' *')
print('*' * (q+4))
