# Написать функцию, которая определяет количество разрядов введенного целого числа.
# Пример:
# >> func(40)
# >> 2


def q(n):
    count = 0
    while n > 1:
        n /= 10
        count += 1
    return count

print(q(4678645637))